# 1.  List (Список):
#     a) Створіть пустий список і додайте до нього 3 різних числа. Виведіть список на екран.
#     б) Змініть значення другого елемента в списку. Виведіть оновлений список.
#     в) Видаліть третій елемент зі списку. Виведіть оновлений список.
#   г) Створіть другий список, з кількома числами більшими за 10. Додайте в кінець першого списку. Виведіть на екран зріз списку від третього до п'ятого елементу.
#   д) Поміняйте місцями найбільше та найменше число в списку.


#a)

lst = []
lst.append(1)
lst.append(2)
lst.append(3)
print(lst)

#б)

lst[1] = 0
print(lst)

#в)

lst.remove(lst[2])
print(lst)

#г)

lst2 = [2, 34, 39, 58, 12]
for i in lst2:
    lst.append(i)
print(lst[2:5])

#д)
def replace_max_and_min(lst):
    #копіюємо для збереження оригінальності листа
    lst_original = lst.copy()

    #сортуємо для знаходження мінімального та максимального значення у списку
    lst.sort()
    minimal = lst[0]
    maximal = lst[len(lst) - 1]

    #шукаємо індекси значень та замінюємо саме їх новими значеннями
    min_index = lst_original.index(minimal)
    max_index = lst_original.index(maximal)
    lst_original[min_index] = maximal
    lst_original[max_index] = minimal

    return lst_original

print(lst)
print(replace_max_and_min(lst))


# 2.  Tuple (Кортеж):
#     а) Створіть кортеж з трьох різних елементів. Виведіть кортеж на екран.
#     Спробуйте змінити значення першого елемента кортежу. Спостереження: кортежі є незмінними, тому ця спроба має завершитися помилкою.
#     б) Створіть другий кортеж та об'єднайте два кортежі в один. Виведіть оновлений кортеж.

#а)
tp = ('str', 24, [33, 87, 6])
print(tp)
#tp[0] = 7 - помилка

#б)
tp2 = (9, 'one', 2.8)
tp3 = tp + tp2
print(tp3)



# 3.  Set (Множина):
#     а) Створіть множину, яка містить 4 різних значення. Виведіть множину на екран.
#     б) Додайте нове значення до множини. Виведіть оновлену множину.
#     в) Видаліть одне значення з множини. Виведіть оновлену множину.

#а)

s = {1, 3.4, 'word', 32}
print(s)

#б)

s.add('diff')
print(s)

#в)

s.remove(3.4)
print(s)



# 4.  Frozenset (Незмінювана множина):
#   а) Створіть frozenset, що містить 3 різних значення. Виведіть frozenset на екран.
#     б) Спробуйте змінити (додати або видалити) значення в frozenset. Спостереження: frozenset є незмінним, тому будь-яка спроба зміни має завершитися помилкою.
#     в) Створіть ще один frozenset з різними значеннями. Об'єднайте два frozenset в новий frozenset. Виведіть отриманий frozenset.

#а)

fs = frozenset((1, 4, 7))
print(fs)

#в)
fs2 = frozenset(('plus', 'to', 'another_frozenset'))
fs3 = fs.union(fs2)
print(fs3)



# 5.  String (Рядок):
#     а) Створіть рядок, що містить ваше ім'я з маленької літери. Виведіть рядок на екран.
#     б) Змініть першу літеру вашого імені на велику літеру. Виведіть оновлений рядок.
#     в) Підрахуйте кількість символів у вашому рядку. Виведіть результат.

#а)
name = 'anzhelika'
print(name)

#б)
name = name.title()
print(name)

#в)
print(len(name))



# 6.  Dict (Словник):
#     а) Створіть словник, що містить пари ключ-значення про ваші улюблені продукти (наприклад: ягода -- суниця).  Виведіть словник на екран.
#     б) Додайте нову пару ключ-значення до словника. Виведіть оновлений словник.
#     в) Видаліть одну пару ключ-значення зі словника. Виведіть оновлений словник.

#а)

dict_of_favourite_products = {'овоч': 'картопля', 'напій': 'вино', 'риба':'лосось'}
print(dict_of_favourite_products)

#б)
dict_of_favourite_products["мʼясо"] = 'курка'
print(dict_of_favourite_products)

#в)
del dict_of_favourite_products['напій']
print(dict_of_favourite_products)